# імпортуємо модуль re, який будемо використовувати для роботи з регулярними виразами
import re  

def sum_profit(text):
    """
    Обчислює загальний дохід з чисел, витягнутих з тексту.

    Args:
        text (str): Текст, з якого потрібно витягнути числа.

    Returns:
        float: Загальний дохід, обчислений з чисел, витягнутих з тексту.
    """
    try:
        # Використовуємо регулярний вираз для знаходження всіх чисел у тексті
        numbers = re.findall(r'\d+\.\d+', text)           
        total_income = sum(map(float, numbers))  # Сумуємо всі числа
    except Exception as e:
        print(f"Помилка: {e}")
        total_income = 0                       # Повертаємо 0 у випадку помилки
    return total_income

# Заданий текст
text = """Загальний дохід працівника складається з декількох частин: 1000.01 як 
основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."""

# Обчислюємо загальний дохід та виводимо результат
total_income = sum_profit(text)
print(f"Загальний дохід: {total_income}")
